Долома/src/Documents/Выбытие/Выбытие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Выбытие</name>
  <registerRecords>InformationRegister.Выбытия</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКлиентами</registerRecords>
  <registerRecords>InformationRegister.РазмещениеЖивотных</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ферма</name>
    <type>
      <types>CatalogRef.Фермы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПадежПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗабойПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РеализацияОткормаПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РеализацияПлеменногоПоголовьяПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродажаНаселениюПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Падеж</name>
    <attributes>
      <name>Животное</name>
      <type>
        <types>CatalogRef.Животные</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Диагноз</name>
      <type>
        <types>CatalogRef.Заболевания</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Забой</name>
    <attributes>
      <name>Животное</name>
      <type>
        <types>CatalogRef.Животные</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Диагноз</name>
      <type>
        <types>CatalogRef.Заболевания</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РеализацияОткорма</name>
    <attributes>
      <name>Животное</name>
      <type>
        <types>CatalogRef.Животные</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаВыбытия</name>
      <type>
        <types>EnumRef.ПричиныВыбытия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РеализацияПлеменногоПоголовья</name>
    <attributes>
      <name>Животное</name>
      <type>
        <types>CatalogRef.Животные</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаВыбытия</name>
      <type>
        <types>EnumRef.ПричиныВыбытия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПродажаНаселению</name>
    <attributes>
      <name>Животное</name>
      <type>
        <types>CatalogRef.Животные</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаВыбытия</name>
      <type>
        <types>EnumRef.ПричиныВыбытия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Долома/src/InformationRegisters/Выбытия/Выбытия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Выбытия</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПричинаВыбытия</name>
    <type>
      <types>EnumRef.ПричиныВыбытия</types>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Диагноз</name>
    <type>
      <types>CatalogRef.Заболевания</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыбытия</name>
    <type>
      <types>EnumRef.СпособыВыбытия</types>
    </type>
  </resources>
  <resources>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Животное</name>
    <type>
      <types>CatalogRef.Животные</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/InformationRegisters/РазмещениеЖивотных/РазмещениеЖивотных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазмещениеЖивотных</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Корпус</name>
    <type>
      <types>CatalogRef.Корпуса</types>
    </type>
  </resources>
  <resources>
    <name>Ферма</name>
    <type>
      <types>CatalogRef.Фермы</types>
    </type>
  </resources>
  <dimensions>
    <name>Животное</name>
    <type>
      <types>CatalogRef.Животные</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/AccumulationRegisters/ВзаиморасчетыСКлиентами/ВзаиморасчетыСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКлиентами</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасхода</name>
    <type>
      <types>CatalogRef.СтатьиРасхода</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Долома/src/Enums/СпособыВыбытия/СпособыВыбытия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВыбытия</name>
  <enumValues>
    <name>Забой</name>
  </enumValues>
  <enumValues>
    <name>Падеж</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаселению</name>
  </enumValues>
  <enumValues>
    <name>РеализацияОткорма</name>
  </enumValues>
  <enumValues>
    <name>РеализацияПлеменногоПоголовья</name>
  </enumValues>
</mdclass:Enum>

Долома/src/Documents/Выбытие/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Выбытия.Записывать 				= Истина;
	Движения.РазмещениеЖивотных.Записывать 		= Истина;
	Движения.ВзаиморасчетыСКлиентами.Записывать = Истина;
	
	Для каждого СтрокаТабличнойЧасти Из Падеж Цикл
		
		НовоеДвижение 				= Движения.Выбытия.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Регистратор 	= Ссылка; 
		ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаТабличнойЧасти);
		НовоеДвижение.СпособВыбытия	= Перечисления.СпособыВыбытия.Падеж;
		
		НовоеДвижение 				= Движения.РазмещениеЖивотных.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Животное 		= СтрокаТабличнойЧасти.Животное;
		НовоеДвижение.Корпус		= Справочники.Корпуса.ПустаяСсылка();
		НовоеДвижение.Регистратор 	= Ссылка;
		НовоеДвижение.Ферма			= Справочники.Фермы.ПустаяСсылка(); 
		
	КонецЦикла;
	
	Для каждого СтрокаТабличнойЧасти Из Забой Цикл
		
		НовоеДвижение 				= Движения.Выбытия.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Регистратор 	= Ссылка;
		ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаТабличнойЧасти);
		НовоеДвижение.СпособВыбытия	= Перечисления.СпособыВыбытия.Забой;
		
		НовоеДвижение 				= Движения.РазмещениеЖивотных.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Животное 		= СтрокаТабличнойЧасти.Животное;
		НовоеДвижение.Корпус		= Справочники.Корпуса.ПустаяСсылка();
		НовоеДвижение.Регистратор 	= Ссылка;
		НовоеДвижение.Ферма			= Справочники.Фермы.ПустаяСсылка();
		
	КонецЦикла;
	
	Для каждого СтрокаТабличнойЧасти Из РеализацияОткорма Цикл
		
		НовоеДвижение 				= Движения.Выбытия.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Регистратор 	= Ссылка;
		ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаТабличнойЧасти); 
		НовоеДвижение.СпособВыбытия	= Перечисления.СпособыВыбытия.РеализацияОткорма;
		
		НовоеДвижение 				= Движения.РазмещениеЖивотных.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Животное 		= СтрокаТабличнойЧасти.Животное;
		НовоеДвижение.Корпус		= Справочники.Корпуса.ПустаяСсылка();
		НовоеДвижение.Регистратор 	= Ссылка;
		НовоеДвижение.Ферма			= Справочники.Фермы.ПустаяСсылка();
		
		НовоеДвижение 				= Движения.ВзаиморасчетыСКлиентами.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Регистратор 	= Ссылка;
		НовоеДвижение.Контрагент 	= Покупатель;
		НовоеДвижение.Номенклатура 	= Справочники.Номенклатура.Животное;
		НовоеДвижение.Сумма 		= СтрокаТабличнойЧасти.Стоимость;
		НовоеДвижение.Цена			= СтрокаТабличнойЧасти.Цена;
		НовоеДвижение.Количество	= 1;
		
	КонецЦикла;

	Для каждого СтрокаТабличнойЧасти Из РеализацияПлеменногоПоголовья Цикл
		
		НовоеДвижение 				= Движения.Выбытия.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Регистратор 	= Ссылка;
		ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаТабличнойЧасти); 
		НовоеДвижение.СпособВыбытия	= Перечисления.СпособыВыбытия.РеализацияПлеменногоПоголовья;
		
		НовоеДвижение 				= Движения.РазмещениеЖивотных.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Животное 		= СтрокаТабличнойЧасти.Животное;
		НовоеДвижение.Корпус		= Справочники.Корпуса.ПустаяСсылка();
		НовоеДвижение.Регистратор 	= Ссылка;
		НовоеДвижение.Ферма			= Справочники.Фермы.ПустаяСсылка();
		
		НовоеДвижение 				= Движения.ВзаиморасчетыСКлиентами.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Регистратор 	= Ссылка;
		НовоеДвижение.Контрагент 	= Покупатель;
		НовоеДвижение.Номенклатура 	= Справочники.Номенклатура.Животное;
		НовоеДвижение.Сумма 		= СтрокаТабличнойЧасти.Стоимость;
		НовоеДвижение.Цена			= СтрокаТабличнойЧасти.Цена;
		НовоеДвижение.Количество	= 1;
		
	КонецЦикла;

	Для каждого СтрокаТабличнойЧасти Из ПродажаНаселению Цикл
		
		НовоеДвижение 				= Движения.Выбытия.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Регистратор 	= Ссылка;
		ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаТабличнойЧасти); 
		НовоеДвижение.СпособВыбытия	= Перечисления.СпособыВыбытия.ПродажаНаселению;
		
		НовоеДвижение 				= Движения.РазмещениеЖивотных.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Животное 		= СтрокаТабличнойЧасти.Животное;
		НовоеДвижение.Корпус		= Справочники.Корпуса.ПустаяСсылка();
		НовоеДвижение.Регистратор 	= Ссылка;
		НовоеДвижение.Ферма			= Справочники.Фермы.ПустаяСсылка();
		
		НовоеДвижение 				= Движения.ВзаиморасчетыСКлиентами.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Регистратор 	= Ссылка;
		НовоеДвижение.Контрагент 	= Покупатель;
		НовоеДвижение.Номенклатура 	= Справочники.Номенклатура.Животное;
		НовоеДвижение.Сумма 		= СтрокаТабличнойЧасти.Стоимость;
		НовоеДвижение.Цена			= СтрокаТабличнойЧасти.Цена;
		НовоеДвижение.Количество	= 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ПадежПредставление 							= "";
	ЗабойПредставление 							= "";
	РеализацияОткормаПредставление 				= "";
	РеализацияПлеменногоПоголовьяПредставление 	= "";
	ПродажаНаселениюПредставление	 			= "";
	
	Для каждого СтрокаТабличнойЧасти Из Падеж Цикл
		
		Если ЗначениеЗаполнено(ПадежПредставление) Тогда
			ПадежПредставление = ПадежПредставление + ", ";
		КонецЕсли;
		
		ПадежПредставление = ПадежПредставление + СтрокаТабличнойЧасти.Животное;
		
	КонецЦикла;
	
	Для каждого СтрокаТабличнойЧасти Из Забой Цикл
		
		Если ЗначениеЗаполнено(ЗабойПредставление) Тогда
			ЗабойПредставление = ЗабойПредставление + ", ";
		КонецЕсли;
		
		ЗабойПредставление = ЗабойПредставление + СтрокаТабличнойЧасти.Животное;
		
	КонецЦикла;

	Для каждого СтрокаТабличнойЧасти Из РеализацияОткорма Цикл
		
		Если ЗначениеЗаполнено(РеализацияОткормаПредставление) Тогда
			РеализацияОткормаПредставление = РеализацияОткормаПредставление + ", ";
		КонецЕсли;
		
		РеализацияОткормаПредставление = РеализацияОткормаПредставление + СтрокаТабличнойЧасти.Животное;
		
	КонецЦикла;

	Для каждого СтрокаТабличнойЧасти Из РеализацияПлеменногоПоголовья Цикл
		
		Если ЗначениеЗаполнено(РеализацияПлеменногоПоголовьяПредставление) Тогда
			РеализацияПлеменногоПоголовьяПредставление = РеализацияПлеменногоПоголовьяПредставление + ", ";
		КонецЕсли;
		
		РеализацияПлеменногоПоголовьяПредставление = РеализацияПлеменногоПоголовьяПредставление + СтрокаТабличнойЧасти.Животное;
		
	КонецЦикла;

	Для каждого СтрокаТабличнойЧасти Из ПродажаНаселению Цикл
		
		Если ЗначениеЗаполнено(ПродажаНаселениюПредставление) Тогда
			ПродажаНаселениюПредставление = ПродажаНаселениюПредставление + ", ";
		КонецЕсли;
		
		ПродажаНаселениюПредставление = ПродажаНаселениюПредставление + СтрокаТабличнойЧасти.Животное;
		
	КонецЦикла;

	
	
КонецПроцедуры
